import matplotlib.pyplot as plt

plt.rcParams["font.sans-serif"] = ["SimHei"]
plt.rcParams["axes.unicode_minus"] = False

# 1 基础绘图
# 第1步：定义x和y坐标轴上的点   x坐标轴上点的数值
y4 = [
   99.2543776,
   99.2543776,
   99.2543776,
   99.2543776,
   99.2543776,
   99.2543776,
   99.2543776,
   99.2543776,
   99.2543776,
   99.2543776,
   99.2543776,
   99.2543776,
   99.2543776,
   99.2543776,
99.2543776,99.2543776,99.2543776
]
y1 = [
    83.0,
83.0,
83.0,
83.0,
83.0,
83.0,
83.0,
83.0,
83.0,
80.7,
80.7,
80.7,
80.7,
80.7,
78.4,
78.4,
78.4
]
y2=[127.4 ,
120.1 ,
115.2 ,
113.2 ,
112.1 ,
110.4 ,
110.4 ,
108.0 ,
107.4 ,
 105.7,
 104.7,
 102.7,
 101.1,
 99.7 ,
 98.5 ,
 98.3 ,
 98.2 ]
# y坐标轴上点的数值
x = [
    100,
    200,
    300,
    400,
    500,
    600,
    700,
    800,
    900,
    1000,
    1100,
    1200,
    1300,
    1400,
    1500,
    1600,1700
]
# 第2步：使用plot绘制线条第1个参数是x的坐标值，第2个参数是y的坐标值
plt.xlabel("迭代次数")
plt.ylabel("时间/s")
# plt.plot(x, y1)
plt.plot(
    x,
    y1,
    "-x",
)
plt.plot(
    x,
    y4,
    "g",
)
plt.plot(
    x,
    y2,
    "-ro",
)
# 第3步：显示图形
plt.show()
